/* =====01. 웹 서비스와 JavaScript===== */

/**
 * 웹 페이지에서 HTML, CSS, JavaScript는 각각 다음과 같은 역할을 합니다.
 * HTML로 구조를 만들고,
 * CSS가 아름답게 꾸며준다면,
 * JavaScript는 다양하게 동작하도록 만들어줍니다.
 *
 * 즉, JavaScript는 사용자의 행동에 반응하여 웹 페이지의 "구조(HTML)나 스타일(CSS)을 바꾸는" 동적인 기능을 담당합니다.
 *
 * ### '웹 페이지가 동작한다'는 것의 의미
 *
 * - 버튼을 클릭하면 팝업창이 뜨거나, 보이지 않던 메뉴가 나타나는 것
 * - 검색어를 입력하면 관련된 상품 목록이 나타나는 것
 * - 로그인 정보를 입력하고 서버와 통신하여 회원임을 확인하는 과정
 *
 * 앞으로 우리는 JavaScript가 어떻게 웹 페이지의 구조(HTML)와 스타일(CSS)을 제어하는지,
 * 즉 "문서 객체 모델(DOM, Document Object Model)"을 다루는 방법을 배우게 될 것입니다.
 * 이 원리를 이해하면 우리가 매일 사용하는 웹 서비스들이 어떻게 만들어졌는지 조금씩 보이기 시작할 것입니다.
 */
