/*=====03. 자료형 개요=====*/
/** 프로그래밍:
 * 특정 목표를 달성하거나 문제를 해결하기 위해 논리적인 절차와 규칙을 설계하고, 
   이를 컴퓨터가 이해할 수 있는 형태로 표현하는 전체적인 과정
 * 문제정의 - 요구사항 분석 - 설계 - 구현(코딩) - 테스트 및 디버깅 - 배포 및 유지보수 */

/** 코딩:
 *  설계된 논리적 절차(알고리즘)를 컴퓨터가 직접 실행할 수 있는 
    특정 프로그래밍 언어의 문법에 맞춰 텍스트 형태로 작성하는 행위 
    프로그래밍 단계 중 구현 단계에 해당한다. */

/*---1. 자료형(Data type)의 종류---*/
/** 1) 숫자(Number)
 * (1) 정수(Integer)
 * (2) 소수(floating point)

 * 숫자 자료형은 사칙연산이 가능 */

/** 2) 문자열(String)
 * 작은 따옴표나 큰 따옴표로 앞뒤를 감싸서 표현하는 형태
 * ex) "Hello", 'world'
 *
 * (1) 주의점: 양 끝의 따옴표의 모양을 통일하지 않으면
 *            처음 시작한 따옴표의 모양을 계속 찾기 때문에 예상치 못한 오류가 발생할 수 있다.
 *
 * (2) 더하기 기호를 통해서 문자열 연결이 가능하다.
 * ex) "Hello" + "world" = "Helloworld" */

/** 3) 불린(Boolean)
 * 참과 거짓을 표현하기 위해서 참을 나타내는 true와 거짓을 나타내는 false, 이 두가지 값만을 가지는 형태
 * 주로 조건에 의한 결괏값으로 사용된다.
 * ex) 조건 8 > 6 => true
 *     조건 8 < 6 => false */

// 뒤에서 자세히 학습할 예정
